Organize/task-7_3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-27 Mon 16:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OSQ+100 Task 7.3 "Verification &amp; Validation" &#x2013; Project Management</title>
<meta name="author" content="Dirk Oliver Theis, University of Tartu, Estonia" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OSQ+100 Task 7.3 "Verification &amp; Validation" &#x2013; Project Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org996b226">1. Task Description</a></li>
<li><a href="#org5b6b5bb">2. Task Outline: Milestones, Deliverables, etc</a>
<ul>
<li><a href="#org1034f18">2.1. Components</a></li>
<li><a href="#org3e91bdf">2.2. Relies on</a></li>
<li><a href="#org0492d47">2.3. Output</a></li>
<li><a href="#orgfbc4b84">2.4. Contributing partners</a></li>
</ul>
</li>
<li><a href="#org8b061c6">3. Task-Leader Reports</a>
<ul>
<li><a href="#orgbc7c285">3.1. TLR Nov 2023: Task 7.3 <i>Verification and Validation</i></a>
<ul>
<li><a href="#orge79acf6">3.1.1. Deviations from Annex I., the consequences and the proposed corrective actions</a></li>
<li><a href="#orgcb0e897">3.1.2. Activities / critical objectives or deliverables</a></li>
<li><a href="#orgefb8563">3.1.3. Implementation risks and mitigation actions</a></li>
<li><a href="#org741d3ed">3.1.4. Unforeseen Risks</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1611b37">4. End Of File</a></li>
</ul>
</div>
</div>

<div id="outline-container-org996b226" class="outline-2">
<h2 id="org996b226"><span class="section-number-2">1.</span> Task Description</h2>
<div class="outline-text-2" id="text-1">
<p>
From the Grant Agreement
</p>

<blockquote>
<p>
<span class="underline">Task 7.3: Verification and Validation</span>
</p>

<p>
(Partners involved: UTartu*, UPV/EHU, CHALMERS, FZJ, Qruise, Duration: month 1-42)
</p>

<p>
The levels of the enabling software stack communicate via interfaces.  This task is concerned with (a)
<b>validating</b> that the top-level interfaces meet the requirements for application quantum software, including
quantum gates/circuits with fault tolerance, and (b) <b>verifying</b> that the implementations match the
specifications.  CHALMERS and UPV/EHU will do (a) as <i>part of their development of application software</i> as
part of the test suite in Tasks 7.1 and 7.2., scheduling it to match the timelines for those tasks.  The
results of Task 7.3 will be applied at <b>test nodes</b> in Task 1.2.  FZJ, Qruise, and UTartu will <i>develop
methodology</i> for verifying the correctness of the implementations (D7.3 in M42; candidate methods will be
identified by M6, implementation and validation of the software will begin before M24).  For levels of the
software stack that link classical input to classical output (e.g., optimization phases in the quantum
compiler), <i>quantum simulation</i> will be deployed (see Task 7.5).  For the levels of the software stack that
directly communicate with the control hardware, process tomography and randomized benchmarking, <b>et cetera</b>,
will be used.  CHALMERS will assist with state and process tomography.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org5b6b5bb" class="outline-2">
<h2 id="org5b6b5bb"><span class="section-number-2">2.</span> Task Outline: Milestones, Deliverables, etc</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1034f18" class="outline-3">
<h3 id="org1034f18"><span class="section-number-3">2.1.</span> Components</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Validation (UPV/EHU, CHALMERS)</li>
<li>Verification (FZJ, Qruise, UTartu)</li>
</ul>
</div>
</div>

<div id="outline-container-org3e91bdf" class="outline-3">
<h3 id="org3e91bdf"><span class="section-number-3">2.2.</span> Relies on</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Respo.</th>
<th scope="col" class="org-right">Start</th>
<th scope="col" class="org-right">Dead</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M7</td>
<td class="org-left">User reqs, system specs &amp; breakdown based on plans, interface defs agreed</td>
<td class="org-left">Orange</td>
<td class="org-right">24-01</td>
<td class="org-right">24-02</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0492d47" class="outline-3">
<h3 id="org0492d47"><span class="section-number-3">2.3.</span> Output</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Start</th>
<th scope="col" class="org-right">Dead</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">O7.3</td>
<td class="org-left">Develop protocols, software for verif.+valid. of full QC stack</td>
<td class="org-right">n/a</td>
<td class="org-right">n/a</td>
</tr>

<tr>
<td class="org-left">M24</td>
<td class="org-left">Consensus of interface specifications for verification</td>
<td class="org-right">2026-01-01</td>
<td class="org-right">2026-02-28</td>
</tr>

<tr>
<td class="org-left">D7.3</td>
<td class="org-left">Methodology for verifying the quantum stack</td>
<td class="org-right">2026-07-01</td>
<td class="org-right">2026-08-31</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfbc4b84" class="outline-3">
<h3 id="orgfbc4b84"><span class="section-number-3">2.4.</span> Contributing partners</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Partner</th>
<th scope="col" class="org-right">Total PMs</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">in WP7</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="underline">UTartu</span></td>
<td class="org-right">36</td>
</tr>

<tr>
<td class="org-left">FZJ</td>
<td class="org-right">70</td>
</tr>

<tr>
<td class="org-left">CHALMERS</td>
<td class="org-right">54</td>
</tr>

<tr>
<td class="org-left">UPV/EHU</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-left">Qruise</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-org8b061c6" class="outline-2">
<h2 id="org8b061c6"><span class="section-number-2">3.</span> Task-Leader Reports</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbc7c285" class="outline-3">
<h3 id="orgbc7c285"><span class="section-number-3">3.1.</span> TLR Nov 2023: Task 7.3 <i>Verification and Validation</i></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Task leader:
<ul class="org-ul">
<li>UTartu</li>
</ul></li>
<li>Other project partners participating in the task:
<ul class="org-ul">
<li>FZJ</li>
<li>Qruise</li>
<li>UPV/EHU</li>
<li>CHALMERS</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orge79acf6" class="outline-4">
<h4 id="orge79acf6"><span class="section-number-4">3.1.1.</span> Deviations from Annex I., the consequences and the proposed corrective actions</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-orgcb0e897" class="outline-4">
<h4 id="orgcb0e897"><span class="section-number-4">3.1.2.</span> Activities / critical objectives or deliverables</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
As indicated in the task description in the GA and then discussed in the consortium meeting in July in Bilbao,
the work for the valification will be carried out by UPV/EHU and CHALMERS, as, in the context of developing
applications to run on the stack, they are in the best position to validate the interfaces.
</p>

<p>
The next milestone concerning Verification is M24 <i>M24 Consensus of OpenSuperQPlus100 interface specifications
for verification</i> in Jan-Feb, 2026.  In moving towards that milestone, Task 7.3 implementers are in
communication with the implementers of Task 8.3 "Standards and interfaces".
</p>

<p>
The process of identifying candidate methods for verification has commenced, and UTartu hired
researcher/specialist to work with 50% workload for identifying and implementing verification methods.  One of
the senior researchers at UTartu has 10% workload on verification methodology as of Oct 1.
</p>
</div>
</div>

<div id="outline-container-orgefb8563" class="outline-4">
<h4 id="orgefb8563"><span class="section-number-4">3.1.3.</span> Implementation risks and mitigation actions</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
N/A
</p>
</div>
</div>

<div id="outline-container-org741d3ed" class="outline-4">
<h4 id="org741d3ed"><span class="section-number-4">3.1.4.</span> Unforeseen Risks</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
No unforeseen risks are foreseen.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1611b37" class="outline-2">
<h2 id="org1611b37"><span class="section-number-2">4.</span> End Of File</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Mon Nov 27 16:42:19 EET 2023</p>
<p class="author">Author: Dirk Oliver Theis, University of Tartu, Estonia</p>
<p class="date">Created: 2023-11-27 Mon 16:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
